import React from 'react';

const facts = [
    "Державний гімн України - 'Ще не вмерла Україна'.",
    "Київ є одним із найдавніших міст Східної Європи, заснованим у V столітті.",
    "Україна проголосила незалежність від Радянського Союзу 24 серпня 1991 року.",
    "Україна має найбільшу площу серед країн, що повністю лежать в Європі.",
];

const HistoricalFacts = () => {
    return (
        <div>
            <h2>Цікаві факти про історію України</h2>
            <ul>
                {facts.map((fact, index) => (
                    <li key={index}>{fact}</li>
                ))}
            </ul>
        </div>
    );
};

export default HistoricalFacts;
